src/InformationRegisters/НастройкиВариантовОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>НастройкиВариантовОтчетов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Видимость</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БыстрыйДоступ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Образец</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Теги</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Рекомендуемый</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФункциональнаяОпция</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Устаревший</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ИзмененаПользователем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Вариант</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыОтчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РольПользователя</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подсистема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовРасширений</v8:Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Comment>Требуется для подключения команд дополнительных отчетов и обработок</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Catalogs/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Сотрудники</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Сотрудник является клиентом</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>APIВес</Name>
					<Comment>Вес сотрудника для API, сначала выводятся более тяжелые</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеСокращенное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Comment>Должность сотрудника</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяИБ</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоОМС</Name>
					<Comment>Код по ОМС</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛогинОнЛайнКалендаря</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеДляСайтаHTML</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольОнЛайнКалендаря</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеДляОнлайнЗаписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Роль</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РольПользователя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлКартинки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Файлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоПользовательИБ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСинхронизации</Name>
					<Comment>Код синхронизации с ID загружаемой базы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодаСтраны</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаПоследниеЦифры</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СпецилазацииСотрудника</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Специализация</Name>
							<Comment>Специализация</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Специализации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основная</Name>
							<Comment>Основная специализация</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДоступныеКассы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Касса</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основная</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДоступныеСтруктурныеЕдиницы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтруктурнаяЕдиница</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДоступныеСтруктурныеЕдиницыЖурналаЗаписи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтруктурнаяЕдиница</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/InformationRegisters/НастройкиВариантовОтчетов/Ext/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2020, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"ПрисоединитьДополнительныеТаблицы
	|ЭтотСписок КАК НастройкиВариантовОтчетов
	|
	|;
	|РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЭтоАвторизованныйПользователь(Пользователь, НЕОПРЕДЕЛЕНО КАК ИСТИНА)
	|	ИЛИ ЭтоАвторизованныйПользователь(Вариант.Автор)";
	
	Ограничение.ТекстДляВнешнихПользователей = Ограничение.Текст;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Записывает таблицу настроек в данные регистра по указанным измерениям.
//
// Параметры:
//  ТаблицаНастроек - ТаблицаЗначений - 
//  Измерения - Структура - где:ъ
//    * Пользователь - СправочникСсылка.Пользователи - 
//                   - СправочникСсылка.ВнешниеПользователи -
//    * Вариант - СправочникСсылка.ВариантыОтчетов -
//    * Подсистема - СправочникСсылка.ИдентификаторыОбъектовМетаданных - 
//                 - СправочникСсылка.ИдентификаторыОбъектовРасширений - 
//  Ресурсы - Структура - где:
//    * Видимость - Булево - 
//    * БыстрыйДоступ - Булево - 
//  УдалятьСтарые - Булево - 
//
Процедура ЗаписатьПакетНастроек(ТаблицаНастроек, Измерения, Ресурсы, УдалятьСтарые, СтруктураПараметровАдминистрирования = Неопределено) Экспорт
	
	НеобходимоПодчиститьПустуюСсылкуПользователя = Ложь;
	Если Измерения.Пользователь = Справочники.Сотрудники.ПустаяСсылка() Тогда 
		Измерения.Пользователь = Неопределено;	
	КонецЕсли;
	Если Измерения.Подсистема = Неопределено Тогда 
		Измерения.Пользователь = Справочники.ИдентификаторыОбъектовМетаданных.ПустаяСсылка();	
	КонецЕсли;
	
	Если СтруктураПараметровАдминистрирования.РежимНастройки Тогда 
		Если СтруктураПараметровАдминистрирования.ДоступноАдминистрированиеОтчетов Тогда 
			Если СтруктураПараметровАдминистрирования.АдминистрированиеЧужихОтчетов Тогда
				Если СтруктураПараметровАдминистрирования.ВариантАдминистрированияОтчетов = "ПоРолям" Тогда 
					Измерения.Пользователь = СтруктураПараметровАдминистрирования.ПользователиРолиФильтр;
				ИначеЕсли СтруктураПараметровАдминистрирования.ВариантАдминистрированияОтчетов = "ПоПользователям" Тогда	
					Измерения.Пользователь = СтруктураПараметровАдминистрирования.ПользователиРолиФильтр;
				Иначе  
					Измерения.Пользователь = Неопределено;
					НеобходимоПодчиститьПустуюСсылкуПользователя = Истина;
				КонецЕсли;
				Измерения.Подсистема = Справочники.ИдентификаторыОбъектовМетаданных.ПустаяСсылка();
				
				// Подчищаем записи с пустыми ссылками на пользователя
				Если НеобходимоПодчиститьПустуюСсылкуПользователя И НЕ ЗначениеЗаполнено(Измерения.Пользователь) Тогда
					НаборЗаписей = СоздатьНаборЗаписей(); // РегистрСведенийНаборЗаписей.НастройкиВариантовОтчетов
					Для Каждого КлючИЗначение Из Измерения Цикл
						Если КлючИЗначение.Ключ = "Пользователь" Тогда 
							НаборЗаписей.Отбор[КлючИЗначение.Ключ].Установить(Справочники.Сотрудники.ПустаяСсылка(), Истина);
						Иначе 
							НаборЗаписей.Отбор[КлючИЗначение.Ключ].Установить(КлючИЗначение.Значение, Истина);
						КонецЕсли;	
					КонецЦикла;
					НаборЗаписей.Записать();
					НаборЗаписей = СоздатьНаборЗаписей(); // РегистрСведенийНаборЗаписей.НастройкиВариантовОтчетов
					Для Каждого КлючИЗначение Из Измерения Цикл
						Если КлючИЗначение.Ключ = "Пользователь" Тогда 
							НаборЗаписей.Отбор[КлючИЗначение.Ключ].Установить(Справочники.Сотрудники.ПустаяСсылка(), Истина);
						ИначеЕсли КлючИЗначение.Ключ = "Подсистема" Тогда 
							НаборЗаписей.Отбор[КлючИЗначение.Ключ].Установить(Неопределено, Истина);
						Иначе 
							НаборЗаписей.Отбор[КлючИЗначение.Ключ].Установить(КлючИЗначение.Значение, Истина);							
						КонецЕсли;				
					КонецЦикла;
					НаборЗаписей.Записать();		
				КонецЕсли;	
				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;	
		
	НаборЗаписей = СоздатьНаборЗаписей(); // РегистрСведенийНаборЗаписей.НастройкиВариантовОтчетов
	Для Каждого КлючИЗначение Из Измерения Цикл
		НаборЗаписей.Отбор[КлючИЗначение.Ключ].Установить(КлючИЗначение.Значение, Истина);
		ТаблицаНастроек.Колонки.Добавить(КлючИЗначение.Ключ);
		ТаблицаНастроек.ЗаполнитьЗначения(КлючИЗначение.Значение, КлючИЗначение.Ключ);
	КонецЦикла;
	Для Каждого КлючИЗначение Из Ресурсы Цикл
		ТаблицаНастроек.Колонки.Добавить(КлючИЗначение.Ключ);
		ТаблицаНастроек.ЗаполнитьЗначения(КлючИЗначение.Значение, КлючИЗначение.Ключ);
	КонецЦикла;
	
	Если Не УдалятьСтарые Тогда
		НаборЗаписей.Прочитать();
		СтарыеЗаписи = НаборЗаписей.Выгрузить();
		ПоискПоИзмерениям = Новый Структура("Пользователь, Подсистема, Вариант");
		Для Каждого СтараяЗапись Из СтарыеЗаписи Цикл
			ЗаполнитьЗначенияСвойств(ПоискПоИзмерениям, СтараяЗапись);
			Если ТаблицаНастроек.НайтиСтроки(ПоискПоИзмерениям).Количество() = 0 Тогда
				ЗаполнитьЗначенияСвойств(ТаблицаНастроек.Добавить(), СтараяЗапись);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	НаборЗаписей.Загрузить(ТаблицаНастроек);
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры

// Очищает настройки по варианту отчета.
Процедура СброситьНастройки(ВариантСсылка = Неопределено) Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписей();
	Если ВариантСсылка <> Неопределено Тогда
		НаборЗаписей.Отбор.Вариант.Установить(ВариантСсылка, Истина);
	КонецЕсли;
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры

// Очищает настройки указанного (или текущего) пользователя в разделе.
Процедура СброситьНастройкиПользователяВРазделе(РазделСсылка, Пользователь = Неопределено) Экспорт
	Если Пользователь = Неопределено Тогда
		Пользователь = Пользователи.АвторизованныйПользователь();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("РазделСсылка", РазделСсылка);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ИдентификаторыОбъектовМетаданных.Ссылка
	|ИЗ
	|	Справочник.ИдентификаторыОбъектовМетаданных КАК ИдентификаторыОбъектовМетаданных
	|ГДЕ
	|	ИдентификаторыОбъектовМетаданных.Ссылка В ИЕРАРХИИ(&РазделСсылка)";
	МассивПодсистем = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Пользователь.Установить(Пользователь, Истина);
	Для Каждого ПодсистемаСсылка Из МассивПодсистем Цикл
		НаборЗаписей.Отбор.Подсистема.Установить(ПодсистемаСсылка, Истина);
		НаборЗаписей.Записать(Истина);
	КонецЦикла;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики чтения / записи настроек доступности варианта отчета.

Функция ПрочитатьНастройкиДоступностиВариантаОтчета(ВариантОтчета) Экспорт 
			
	Запрос       = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НастройкиВариантовОтчетов.Пользователь КАК Пользователь,
	|   ПРЕДСТАВЛЕНИЕ(НастройкиВариантовОтчетов.Пользователь) КАК Представление
	|ИЗ
	|	РегистрСведений.НастройкиВариантовОтчетов КАК НастройкиВариантовОтчетов
	|ГДЕ
	|	НастройкиВариантовОтчетов.Вариант = &Вариант
	|	И НастройкиВариантовОтчетов.Видимость
	|	И (НастройкиВариантовОтчетов.Пользователь <> ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|			И НастройкиВариантовОтчетов.Пользователь <> ЗНАЧЕНИЕ(Перечисление.РольПользователя.ПустаяССылка)
	|			И НастройкиВариантовОтчетов.Пользователь <> НЕОПРЕДЕЛЕНО)
	|
	|СГРУППИРОВАТЬ ПО
	|	НастройкиВариантовОтчетов.Пользователь
	|
	|УПОРЯДОЧИТЬ ПО
	|	Пользователь";
	
	Запрос.УстановитьПараметр("Вариант", ВариантОтчета);	
	ПользователиВарианта = Новый СписокЗначений;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПользователиВарианта.Добавить(Выборка.Пользователь, Выборка.Представление);
	КонецЦикла;
	
	Возврат ПользователиВарианта;
	
КонецФункции

Функция ПрочитатьНастройкиДоступностиВариантаОтчета2(ВариантОтчета, ПользователиВариантаРедактирование = Неопределено) Экспорт 
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Если ПользователиВариантаРедактирование = Неопределено Тогда 
		
		Запрос       = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	&Вариант КАК Вариант,
		|	Сотрудники.Ссылка КАК ПользовательРоль,
		|	ПРЕДСТАВЛЕНИЕ(Сотрудники.Ссылка) КАК Представление,
		|	Сотрудники.Роль КАК РольПользователя,
		|	ИСТИНА КАК ЭтоПользователь,
		|	ЛОЖЬ КАК ЭтоРоль,
		|	Сотрудники.Наименование КАК Наименование
		|ПОМЕСТИТЬ ТаблицаПользователейРолей
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|ГДЕ
		|	Сотрудники.ИдентификаторПользователяИБ <> &Идентификатор
		|	И НЕ Сотрудники.ПометкаУдаления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&Вариант,
		|	РолиПользователя.Ссылка,
		|	ПРЕДСТАВЛЕНИЕ(РолиПользователя.Ссылка),
		|	НЕОПРЕДЕЛЕНО,
		|	ЛОЖЬ,
		|	ИСТИНА,
		|	РолиПользователя.Порядок
		|ИЗ
		|	Перечисление.РольПользователя КАК РолиПользователя
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НастройкиВариантовОтчетов.Вариант КАК Вариант,
		|	НастройкиВариантовОтчетов.Пользователь КАК Пользователь,
		|	НастройкиВариантовОтчетов.Подсистема КАК Подсистема,
		|	НастройкиВариантовОтчетов.Видимость КАК Видимость
		|ПОМЕСТИТЬ НастройкиВарианта
		|ИЗ
		|	РегистрСведений.НастройкиВариантовОтчетов КАК НастройкиВариантовОтчетов
		|ГДЕ
		|	НастройкиВариантовОтчетов.Вариант = &Вариант
		|	И НастройкиВариантовОтчетов.Подсистема = ЗНАЧЕНИЕ(Справочник.ИдентификаторыОбъектовМетаданных.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаПользователейРолей.Вариант КАК Вариант,
		|	ТаблицаПользователейРолей.ПользовательРоль КАК ПользовательРоль,
		|	ТаблицаПользователейРолей.ЭтоПользователь КАК ЭтоПользователь,
		|	ТаблицаПользователейРолей.ЭтоРоль КАК ЭтоРоль,
		|	ТаблицаПользователейРолей.Представление КАК Представление,
		|	НЕ ДоступныеВариантыОтчетовДляПользователя.Видимость ЕСТЬ NULL КАК ЕстьНастройкаДляПользователя,
		|	НЕ ДоступныеВариантыОтчетовДляРолейПользователей.Видимость ЕСТЬ NULL КАК ЕстьНастройкаДляРоли,
		|	НЕ ДоступныеВариантыОтчетовПоУмолчанию.Видимость ЕСТЬ NULL КАК ЕстьНастройкаПоУмолчанию,
		|	ВЫБОР
		|		КОГДА ДоступныеВариантыОтчетовДляПользователя.Видимость ЕСТЬ NULL
		|			ТОГДА ВЫБОР
		|					КОГДА ДоступныеВариантыОтчетовДляПользователяПоРолям.Видимость ЕСТЬ NULL
		|						ТОГДА ВЫБОР
		|								КОГДА ДоступныеВариантыОтчетовДляРолейПользователей.Видимость ЕСТЬ NULL
		|									ТОГДА ЕСТЬNULL(ДоступныеВариантыОтчетовПоУмолчанию.Видимость, ЛОЖЬ)
		|								ИНАЧЕ ДоступныеВариантыОтчетовДляРолейПользователей.Видимость
		|							КОНЕЦ
		|					ИНАЧЕ ДоступныеВариантыОтчетовДляПользователяПоРолям.Видимость
		|				КОНЕЦ
		|		ИНАЧЕ ДоступныеВариантыОтчетовДляПользователя.Видимость
		|	КОНЕЦ КАК Видимость
		|ИЗ
		|	ТаблицаПользователейРолей КАК ТаблицаПользователейРолей
		|		ЛЕВОЕ СОЕДИНЕНИЕ НастройкиВарианта КАК ДоступныеВариантыОтчетовДляПользователя
		|		ПО (ДоступныеВариантыОтчетовДляПользователя.Вариант = ТаблицаПользователейРолей.Вариант)
		|			И (ДоступныеВариантыОтчетовДляПользователя.Пользователь ССЫЛКА Справочник.Сотрудники)
		|			И (ДоступныеВариантыОтчетовДляПользователя.Пользователь = ТаблицаПользователейРолей.ПользовательРоль)
		|		ЛЕВОЕ СОЕДИНЕНИЕ НастройкиВарианта КАК ДоступныеВариантыОтчетовДляПользователяПоРолям
		|		ПО (ДоступныеВариантыОтчетовДляПользователяПоРолям.Вариант = ТаблицаПользователейРолей.Вариант)
		|			И (ДоступныеВариантыОтчетовДляПользователяПоРолям.Пользователь ССЫЛКА Перечисление.РольПользователя)
		|			И (ДоступныеВариантыОтчетовДляПользователяПоРолям.Пользователь = ТаблицаПользователейРолей.РольПользователя)
		|		ЛЕВОЕ СОЕДИНЕНИЕ НастройкиВарианта КАК ДоступныеВариантыОтчетовДляРолейПользователей
		|		ПО (ДоступныеВариантыОтчетовДляРолейПользователей.Вариант = ТаблицаПользователейРолей.Вариант)
		|			И (ДоступныеВариантыОтчетовДляРолейПользователей.Пользователь ССЫЛКА Перечисление.РольПользователя)
		|			И (ДоступныеВариантыОтчетовДляРолейПользователей.Пользователь = ТаблицаПользователейРолей.ПользовательРоль)
		|		ЛЕВОЕ СОЕДИНЕНИЕ НастройкиВарианта КАК ДоступныеВариантыОтчетовПоУмолчанию
		|		ПО (ДоступныеВариантыОтчетовПоУмолчанию.Вариант = ТаблицаПользователейРолей.Вариант)
		|			И (ДоступныеВариантыОтчетовПоУмолчанию.Пользователь В (ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка), НЕОПРЕДЕЛЕНО))
		|
		|УПОРЯДОЧИТЬ ПО
		|	ТаблицаПользователейРолей.Наименование";
		
		Запрос.УстановитьПараметр("Вариант", ВариантОтчета);
		Запрос.УстановитьПараметр("Идентификатор", Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
		
		ТаблицаНастроек 						= Запрос.Выполнить().Выгрузить();
		
		ДоступенВсем 							= ТаблицаНастроек.НайтиСтроки(Новый Структура("ЭтоПользователь, Видимость", Истина, Ложь)).Количество() = 0;
		
		СписокТиповПользователей = Новый Массив;
		СписокТиповПользователей.Добавить(Тип("ПеречислениеСсылка.РольПользователя"));
		СписокТиповПользователей.Добавить(Тип("СправочникСсылка.Сотрудники"));
		ОписаниеСоставногоТипаПользователя = Новый ОписаниеТипов(СписокТиповПользователей);		
		
		ПользователиВарианта 								= Новый СписокЗначений;
		ПользователиВарианта.ТипЗначения 					= ОписаниеСоставногоТипаПользователя;
		ПользователиВарианта.ДоступныеЗначения 				= Новый СписокЗначений;
		ПользователиВарианта.ДоступныеЗначения.ТипЗначения 	= ОписаниеСоставногоТипаПользователя;
		
		Для Каждого СтрокаНастройка Из ТаблицаНастроек Цикл
			ПользователиВарианта.ДоступныеЗначения.Добавить(СтрокаНастройка.ПользовательРоль, СтрокаНастройка.Представление, СтрокаНастройка.Видимость);
			Если НЕ ДоступенВсем Тогда 
				Если СтрокаНастройка.Видимость = Истина Тогда 
					ПользователиВарианта.Добавить(СтрокаНастройка.ПользовательРоль, СтрокаНастройка.Представление, СтрокаНастройка.Видимость);
				КонецЕсли;	
			КонецЕсли;	
		КонецЦикла;
		
	Иначе 
		
		ТаблицаОтредактированыхНастроек = Новый ТаблицаЗначений;
		СписокТиповПользователей = Новый Массив;
		СписокТиповПользователей.Добавить(Тип("ПеречислениеСсылка.РольПользователя"));
		СписокТиповПользователей.Добавить(Тип("СправочникСсылка.Сотрудники"));
		ОписаниеСоставногоТипаПользователя = Новый ОписаниеТипов(СписокТиповПользователей);		
		СписокТиповПодсистем = Новый Массив;
		СписокТиповПодсистем.Добавить(Тип("СправочникСсылка.ИдентификаторыОбъектовРасширений"));
		СписокТиповПодсистем.Добавить(Тип("СправочникСсылка.ИдентификаторыОбъектовМетаданных"));
		ОписаниеСоставногоТипаПодсистем = Новый ОписаниеТипов(СписокТиповПодсистем);		

		ТаблицаОтредактированыхНастроек.Колонки.Добавить("Вариант"			, Новый ОписаниеТипов("СправочникСсылка.ВариантыОтчетов"));
		ТаблицаОтредактированыхНастроек.Колонки.Добавить("Пользователь"		, ОписаниеСоставногоТипаПользователя);
		ТаблицаОтредактированыхНастроек.Колонки.Добавить("Подсистема"		, ОписаниеСоставногоТипаПодсистем);
		ТаблицаОтредактированыхНастроек.Колонки.Добавить("Видимость"		, Новый ОписаниеТипов("Булево"));
		
		Для Каждого ЭлементСписка Из ПользователиВариантаРедактирование Цикл
			Если НЕ ЗначениеЗаполнено(ЭлементСписка.Значение) Тогда 
				Продолжить;
			КонецЕсли;	
			НоваяСтрокаТаблицы 				= ТаблицаОтредактированыхНастроек.Добавить();
		    НоваяСтрокаТаблицы.Вариант 		= ВариантОтчета;
			НоваяСтрокаТаблицы.Пользователь = ЭлементСписка.Значение;
		    НоваяСтрокаТаблицы.Подсистема 	= Справочники.ИдентификаторыОбъектовМетаданных.ПустаяСсылка();
		    НоваяСтрокаТаблицы.Видимость 	= ЭлементСписка.Пометка;
		КонецЦикла;
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = УправлениеЗапасамиПартионныйУчет.ВыбратьТЗВВременнуюТаблицу(ТаблицаОтредактированыхНастроек, "ТаблицаОтредактированыхНастроек");
		Запрос.Текст =
		"ВЫБРАТЬ
		|	&Вариант КАК Вариант,
		|	Сотрудники.Ссылка КАК ПользовательРоль,
		|	ПРЕДСТАВЛЕНИЕ(Сотрудники.Ссылка) КАК Представление,
		|	Сотрудники.Роль КАК РольПользователя,
		|	ИСТИНА КАК ЭтоПользователь,
		|	ЛОЖЬ КАК ЭтоРоль,
		|	Сотрудники.Наименование КАК Наименование
		|ПОМЕСТИТЬ ТаблицаПользователейРолей
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|ГДЕ
		|	Сотрудники.ИдентификаторПользователяИБ <> &Идентификатор
		|	И НЕ Сотрудники.ПометкаУдаления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&Вариант,
		|	РолиПользователя.Ссылка,
		|	ПРЕДСТАВЛЕНИЕ(РолиПользователя.Ссылка),
		|	НЕОПРЕДЕЛЕНО,
		|	ЛОЖЬ,
		|	ИСТИНА,
		|	РолиПользователя.Порядок
		|ИЗ
		|	Перечисление.РольПользователя КАК РолиПользователя
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НастройкиВариантовОтчетов.Вариант КАК Вариант,
		|	НастройкиВариантовОтчетов.Пользователь КАК Пользователь,
		|	НастройкиВариантовОтчетов.Подсистема КАК Подсистема,
		|	НастройкиВариантовОтчетов.Видимость КАК Видимость
		|ПОМЕСТИТЬ НастройкиВарианта
		|ИЗ
		|	РегистрСведений.НастройкиВариантовОтчетов КАК НастройкиВариантовОтчетов
		|ГДЕ
		|	НастройкиВариантовОтчетов.Вариант = &Вариант
		|	И НастройкиВариантовОтчетов.Подсистема = ЗНАЧЕНИЕ(Справочник.ИдентификаторыОбъектовМетаданных.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаПользователейРолей.Вариант КАК Вариант,
		|	ТаблицаПользователейРолей.ПользовательРоль КАК ПользовательРоль,
		|	ТаблицаПользователейРолей.ЭтоПользователь КАК ЭтоПользователь,
		|	ТаблицаПользователейРолей.ЭтоРоль КАК ЭтоРоль,
		|	ТаблицаПользователейРолей.Представление КАК Представление,
		|	НЕ ДоступныеВариантыОтчетовДляПользователя.Видимость ЕСТЬ NULL КАК ЕстьНастройкаДляПользователя,
		|	НЕ ДоступныеВариантыОтчетовДляРолейПользователей.Видимость ЕСТЬ NULL КАК ЕстьНастройкаДляРоли,
		|	НЕ ДоступныеВариантыОтчетовПоУмолчанию.Видимость ЕСТЬ NULL КАК ЕстьНастройкаПоУмолчанию,
		|	ВЫБОР
		|		КОГДА ТаблицаОтредактированыхНастроек.Видимость ЕСТЬ NULL
		|			ТОГДА ВЫБОР
		|					КОГДА ДоступныеВариантыОтчетовДляПользователя.Видимость ЕСТЬ NULL
		|						ТОГДА ВЫБОР
		|								КОГДА ДоступныеВариантыОтчетовДляПользователяПоРолям.Видимость ЕСТЬ NULL
		|									ТОГДА ВЫБОР
		|											КОГДА ДоступныеВариантыОтчетовДляРолейПользователей.Видимость ЕСТЬ NULL
		|												ТОГДА ЕСТЬNULL(ДоступныеВариантыОтчетовПоУмолчанию.Видимость, ЛОЖЬ)
		|											ИНАЧЕ ДоступныеВариантыОтчетовДляРолейПользователей.Видимость
		|										КОНЕЦ
		|								ИНАЧЕ ДоступныеВариантыОтчетовДляПользователяПоРолям.Видимость
		|							КОНЕЦ
		|					ИНАЧЕ ДоступныеВариантыОтчетовДляПользователя.Видимость
		|				КОНЕЦ
		|		ИНАЧЕ ТаблицаОтредактированыхНастроек.Видимость
		|	КОНЕЦ КАК Видимость
		|ИЗ
		|	ТаблицаПользователейРолей КАК ТаблицаПользователейРолей
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОтредактированыхНастроек КАК ТаблицаОтредактированыхНастроек
		|		ПО (ТаблицаОтредактированыхНастроек.Вариант = ТаблицаПользователейРолей.Вариант)
		|			И (ТаблицаОтредактированыхНастроек.Пользователь = ТаблицаПользователейРолей.ПользовательРоль)
		|		ЛЕВОЕ СОЕДИНЕНИЕ НастройкиВарианта КАК ДоступныеВариантыОтчетовДляПользователя
		|		ПО (ДоступныеВариантыОтчетовДляПользователя.Вариант = ТаблицаПользователейРолей.Вариант)
		|			И (ДоступныеВариантыОтчетовДляПользователя.Пользователь ССЫЛКА Справочник.Сотрудники)
		|			И (ДоступныеВариантыОтчетовДляПользователя.Пользователь = ТаблицаПользователейРолей.ПользовательРоль)
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			НастройкиВарианта.Вариант КАК Вариант,
		|			НастройкиВарианта.Пользователь КАК Пользователь,
		|			НастройкиВарианта.Подсистема КАК Подсистема,
		|			ЕСТЬNULL(ТаблицаОтредактированыхНастроекПоРолям.Видимость, НастройкиВарианта.Видимость) КАК Видимость
		|		ИЗ
		|			НастройкиВарианта КАК НастройкиВарианта
		|				ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОтредактированыхНастроек КАК ТаблицаОтредактированыхНастроекПоРолям
		|				ПО (ТаблицаОтредактированыхНастроекПоРолям.Вариант = НастройкиВарианта.Вариант)
		|					И (ТаблицаОтредактированыхНастроекПоРолям.Пользователь = НастройкиВарианта.Пользователь)) КАК ДоступныеВариантыОтчетовДляПользователяПоРолям
		|		ПО (ДоступныеВариантыОтчетовДляПользователяПоРолям.Вариант = ТаблицаПользователейРолей.Вариант)
		|			И (ДоступныеВариантыОтчетовДляПользователяПоРолям.Пользователь ССЫЛКА Перечисление.РольПользователя)
		|			И (ДоступныеВариантыОтчетовДляПользователяПоРолям.Пользователь = ТаблицаПользователейРолей.РольПользователя)
		|		ЛЕВОЕ СОЕДИНЕНИЕ НастройкиВарианта КАК ДоступныеВариантыОтчетовДляРолейПользователей
		|		ПО (ДоступныеВариантыОтчетовДляРолейПользователей.Вариант = ТаблицаПользователейРолей.Вариант)
		|			И (ДоступныеВариантыОтчетовДляРолейПользователей.Пользователь ССЫЛКА Перечисление.РольПользователя)
		|			И (ДоступныеВариантыОтчетовДляРолейПользователей.Пользователь = ТаблицаПользователейРолей.ПользовательРоль)
		|		ЛЕВОЕ СОЕДИНЕНИЕ НастройкиВарианта КАК ДоступныеВариантыОтчетовПоУмолчанию
		|		ПО (ДоступныеВариантыОтчетовПоУмолчанию.Вариант = ТаблицаПользователейРолей.Вариант)
		|			И (ДоступныеВариантыОтчетовПоУмолчанию.Пользователь В (ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка), НЕОПРЕДЕЛЕНО))
		|
		|УПОРЯДОЧИТЬ ПО
		|	ТаблицаПользователейРолей.Наименование";
		
		Запрос.УстановитьПараметр("Вариант", ВариантОтчета);
		Запрос.УстановитьПараметр("Идентификатор", Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
		
		ТаблицаНастроек = Запрос.Выполнить().Выгрузить();
		
		Запрос.МенеджерВременныхТаблиц.Закрыть();
		
		ДоступенВсем 			= ТаблицаНастроек.НайтиСтроки(Новый Структура("ЭтоПользователь, Видимость", Истина, Ложь)).Количество() = 0;

		ПользователиВарианта 								= Новый СписокЗначений;
		ПользователиВарианта.ТипЗначения 					= ОписаниеСоставногоТипаПользователя;
		ПользователиВарианта.ДоступныеЗначения 				= Новый СписокЗначений;
		ПользователиВарианта.ДоступныеЗначения.ТипЗначения 	= ОписаниеСоставногоТипаПользователя;
		
		Для Каждого СтрокаНастройка Из ТаблицаНастроек Цикл
			ПользователиВарианта.ДоступныеЗначения.Добавить(СтрокаНастройка.ПользовательРоль, СтрокаНастройка.Представление, СтрокаНастройка.Видимость);
			Если НЕ ДоступенВсем Тогда 
				Если СтрокаНастройка.Видимость = Истина Тогда 
					ПользователиВарианта.Добавить(СтрокаНастройка.ПользовательРоль, СтрокаНастройка.Представление, СтрокаНастройка.Видимость);
				КонецЕсли;	
			КонецЕсли;	
		КонецЦикла;
		
	КонецЕсли;

	Возврат ПользователиВарианта;
	
КонецФункции

Процедура ЗаписатьНастройкиДоступностиВариантаОтчета(ВариантОтчета, ЭтоНовыйВариантОтчета, ПользователиВарианта = Неопределено,
	ИспользоватьГруппыПользователей = Неопределено, ИспользоватьВнешнихПользователей = Неопределено, УстанавливатьПоПометке = Ложь) Экспорт 
	
	Если ПользователиВарианта = Неопределено Тогда 
		ПользователиВарианта = ПользователиВариантаОтчетаПоУмолчанию(ВариантОтчета);
	КонецЕсли;
	
	Если ТипЗнч(ПользователиВарианта) <> Тип("СписокЗначений") Тогда
		Возврат;
	КонецЕсли;
	
	НачатьТранзакцию();
	
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		
		Если Не ЭтоНовыйВариантОтчета Тогда
			
			ЭлементБлокировки = Блокировка.Добавить(Метаданные.РегистрыСведений.НастройкиВариантовОтчетов.ПолноеИмя());
			ЭлементБлокировки.УстановитьЗначение("Вариант", ВариантОтчета);
			
		КонецЕсли;
		
		Блокировка.Заблокировать();
		
		ДобавитьПользователейВариантаОтчета(
			ВариантОтчета, ПользователиВарианта, ИспользоватьГруппыПользователей, ИспользоватьВнешнихПользователей, УстанавливатьПоПометке);
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		ВызватьИсключение;
		
	КонецПопытки;
	
КонецПроцедуры

Функция ПользователиВариантаОтчетаПоУмолчанию(ВариантОтчета)
	
	Если НастройкиДоступностиВариантаОтчетаУстановлены(ВариантОтчета) Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	НЕОПРЕДЕЛЕНО КАК Пользователь
	|ИЗ
	|	Справочник.ВариантыОтчетов КАК Отчеты
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыОтчетов.Размещение КАК РазмещениеОтчетов
	|		ПО РазмещениеОтчетов.Ссылка = Отчеты.Ссылка
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПредопределенныеВариантыОтчетов КАК ОтчетыКонфигурации
	|		ПО ОтчетыКонфигурации.Ссылка = Отчеты.ПредопределенныйВариант
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПредопределенныеВариантыОтчетов.Размещение КАК РазмещениеОтчетовКонфигурации
	|		ПО РазмещениеОтчетовКонфигурации.Ссылка = Отчеты.ПредопределенныйВариант
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПредопределенныеВариантыОтчетовРасширений КАК ОтчетыРасширений
	|		ПО ОтчетыРасширений.Ссылка = Отчеты.ПредопределенныйВариант
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПредопределенныеВариантыОтчетовРасширений.Размещение КАК РазмещениеОтчетовРасширений
	|		ПО РазмещениеОтчетовРасширений.Ссылка = Отчеты.ПредопределенныйВариант
	|ГДЕ
	|	Отчеты.Ссылка = &ВариантОтчета
	|	И ЕСТЬNULL(РазмещениеОтчетов.Использование, ИСТИНА) 
	|	И НЕ ЕСТЬNULL(РазмещениеОтчетов.Подсистема,
	|		ЕСТЬNULL(РазмещениеОтчетовКонфигурации.Подсистема, РазмещениеОтчетовРасширений.Подсистема)) ЕСТЬ NULL
	|	И ЕСТЬNULL(ОтчетыКонфигурации.ВидимостьПоУмолчанию, ОтчетыРасширений.ВидимостьПоУмолчанию) = ИСТИНА");
	
	Запрос.УстановитьПараметр("ВариантОтчета", ВариантОтчета);
	
	Если Запрос.Выполнить().Пустой() Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	ПользователиВарианта = Новый СписокЗначений;
	ПользователиВарианта.ТипЗначения = Новый ОписаниеТипов(
		"СправочникСсылка.Сотрудники");
	
	ПользователиВарианта.Добавить(,, Истина);
	
	Возврат ПользователиВарианта;
	
КонецФункции

Функция НастройкиДоступностиВариантаОтчетаУстановлены(ВариантОтчета)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ИСТИНА
	|ИЗ
	|	РегистрСведений.НастройкиВариантовОтчетов
	|ГДЕ
	|	Вариант = &ВариантОтчета
	|	И Подсистема = ЗНАЧЕНИЕ(Справочник.ИдентификаторыОбъектовМетаданных.ПустаяСсылка)");
	
	Запрос.УстановитьПараметр("ВариантОтчета", ВариантОтчета);
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

Процедура ДобавитьПользователейВариантаОтчета(ВариантОтчета, ПользователиВарианта, ИспользоватьГруппыПользователей, ИспользоватьВнешнихПользователей, УстанавливатьПоПометке = Ложь)
	
	Подсистема = Справочники.ИдентификаторыОбъектовМетаданных.ПустаяСсылка();
	
	ВключитьБизнесЛогику = Не ОбновлениеИнформационнойБазы.ВыполняетсяОбновлениеИнформационнойБазы();
	
	Если УстанавливатьПоПометке И ЗначениеЗаполнено(ПользователиВарианта) Тогда
		// Создаем настройки для пользователей
		Для Каждого ЭлементСписка Из ПользователиВарианта Цикл 
			Записи = СоздатьНаборЗаписей();
			Записи.Отбор.Вариант.Установить(ВариантОтчета);
			Записи.Отбор.Подсистема.Установить(Подсистема);
			Записи.Отбор.Пользователь.Установить(ЭлементСписка.Значение);	
			//Записи.Прочитать();
			
			Запись = Записи.Добавить();
			
			Запись.Вариант      = ВариантОтчета;
			Запись.Пользователь = ЭлементСписка.Значение;
			Запись.Подсистема   = Подсистема;
			Запись.Видимость    = ЭлементСписка.Пометка;
			
			Записи.Записать();
		КонецЦикла;
	Иначе 		
		// Создаем базовую настройку по умолчанию
		Записи = СоздатьНаборЗаписей();
		Записи.Отбор.Вариант.Установить(ВариантОтчета);
		Записи.Отбор.Подсистема.Установить(Подсистема);
		Записи.Отбор.Пользователь.Установить(Неопределено);	
		Записи.Прочитать();
		
		Если Записи.Количество() = 0 Тогда 
			Запись 				= Записи.Добавить();
			Запись.Вариант      = ВариантОтчета;
			Запись.Пользователь = Неопределено;
			Запись.Подсистема   = Подсистема;
			Запись.Видимость    = НЕ ЗначениеЗаполнено(ПользователиВарианта);
			
			Записи.Записать();
		КонецЕсли;
		
		// Создаем настройки для пользователей
		Для Каждого ЭлементСписка Из ПользователиВарианта Цикл 
			Записи = СоздатьНаборЗаписей();
			Записи.Отбор.Вариант.Установить(ВариантОтчета);
			Записи.Отбор.Подсистема.Установить(Подсистема);
			Записи.Отбор.Пользователь.Установить(ЭлементСписка.Значение);	
			//Записи.Прочитать();
			
			Запись = Записи.Добавить();
			
			Запись.Вариант      = ВариантОтчета;
			Запись.Пользователь = ЭлементСписка.Значение;
			Запись.Подсистема   = Подсистема;
			Запись.Видимость    = Истина;
			
			Записи.Записать();
		КонецЦикла;
	КонецЕсли;	
	//ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(Записи,,, ВключитьБизнесЛогику);
	
КонецПроцедуры

Функция ВыбранныеПользователиВариантаОтчета(ПользователиВарианта, ИспользоватьГруппыПользователей, ИспользоватьВнешнихПользователей)
	
	Если ИспользоватьГруппыПользователей = Неопределено Тогда 
		ИспользоватьГруппыПользователей = Ложь;
	КонецЕсли;
	
	Если ИспользоватьВнешнихПользователей = Неопределено Тогда 
		ИспользоватьВнешнихПользователей = Ложь;
	КонецЕсли;
	
	Если ИспользоватьГруппыПользователей
		Или ИспользоватьВнешнихПользователей Тогда 
		
		Возврат ПользователиВарианта.ВыгрузитьЗначения();
		
	КонецЕсли;
	
	ВыбранныеПользователи = Новый Массив;
	
	Для Каждого ЭлементСписка Из ПользователиВарианта Цикл 
		
		Если ЭлементСписка.Пометка Тогда 
			ВыбранныеПользователи.Добавить(ЭлементСписка.Значение);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ВыбранныеПользователи;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Обработчики оповещения пользователей варианта отчета.

Процедура ЗаписатьПользователиВариантаОтчетаДоИзменения(Записи) Экспорт 
	
	// Проверка возможности записи (кэширования) состояния настроек доступности варианта отчета до записи в регистр.
	Если Не ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Обсуждения") Тогда
		Возврат;
	КонецЕсли;
	
	МодульОбсужденияСлужебный = ОбщегоНазначения.ОбщийМодуль("ОбсужденияСлужебный");
	
	Если Не МодульОбсужденияСлужебный.Подключены()
		Или Записи.Количество() = 0 Тогда 
		
		Возврат;
	КонецЕсли;
	
	ЭлементОтбора = Записи.Отбор.Найти("Подсистема");
	Если ЭлементОтбора = Неопределено
		Или ЭлементОтбора.Значение <> Справочники.ИдентификаторыОбъектовМетаданных.ПустаяСсылка() Тогда 
		
		Возврат;
	КонецЕсли;
	
	ЭлементОтбора = Записи.Отбор.Найти("Вариант");
	Если ЭлементОтбора = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	// Запись (кэширование) состояния настроек доступности варианта отчета до записи в регистр.
	УстановитьПривилегированныйРежим(Истина);
	
	ПользователиВариантаОтчета = ПользователиВариантаОтчета(ЭлементОтбора.Значение);
	ПользователиВариантаОтчетаПроиндексированные = Новый Соответствие;
	
	Пока ПользователиВариантаОтчета.Следующий() Цикл 
		
		ПользователиВариантаОтчетаПроиндексированные.Вставить(
			ПользователиВариантаОтчета.Идентификатор, ПользователиВариантаОтчета.Ссылка);
		
	КонецЦикла;
	
	Записи.ДополнительныеСвойства.Вставить(
		"ПользователиВариантаОтчетаДоИзменения", ПользователиВариантаОтчетаПроиндексированные);
	
КонецПроцедуры

// Создает сообщение в контексте варианта отчета, уведомляющее пользователей,
//  которым предоставлены права на данный вариант отчета.
//
// Параметры:
//  Записи - РегистрСведенийНаборЗаписей.НастройкиВариантовОтчетов - 
//
Процедура ОповеститьПользователейВариантаОтчета(Записи) Экспорт 
	
	#Область Проверка
	
	Если Не ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Обсуждения") Тогда
		Возврат;
	КонецЕсли;
	
	МодульОбсужденияСлужебный = ОбщегоНазначения.ОбщийМодуль("ОбсужденияСлужебный");
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПользователиВариантаОтчетаДоИзменения = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		Записи.ДополнительныеСвойства, "ПользователиВариантаОтчетаДоИзменения");
	
	Если ТипЗнч(ПользователиВариантаОтчетаДоИзменения) <> Тип("Соответствие") Тогда 
		Возврат;
	КонецЕсли;
	
	#КонецОбласти
	
	#Область АнализСостоянияНастроекДоступностиВариантаОтчета
	
	Получатели = Новый Массив;
	
	ЭлементОтбора = Записи.Отбор.Найти("Вариант");
	ПользователиВарианта = ПользователиВариантаОтчета(ЭлементОтбора.Значение);
	
	Пока ПользователиВарианта.Следующий() Цикл 
		
		Если ПользователиВариантаОтчетаДоИзменения[ПользователиВарианта.Идентификатор] <> Неопределено Тогда 
			Продолжить;
		КонецЕсли;
		
		Попытка
			ИдентификаторПользователя = СистемаВзаимодействия.ПолучитьИдентификаторПользователя(
				ПользователиВарианта.Идентификатор);
		Исключение
			Продолжить;
		КонецПопытки;
		
		Получатели.Добавить(ИдентификаторПользователя);
		
	КонецЦикла;
	
	Если Получатели.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;
	
	#КонецОбласти
	
	#Область ГенерацияОповещенияНовыхПользователейВариантаОтчета
	
	ВариантОтчета = Записи[0].Вариант;
	ПредставлениеВариантаОтчета = Строка(ВариантОтчета);
	
	ЗаголовокОбсуждения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Доступ к отчету ""%1""'"), ПредставлениеВариантаОтчета);
	
	Обсуждение = МодульОбсужденияСлужебный.ОбсуждениеКонтекстное(ВариантОтчета, ЗаголовокОбсуждения);
	
	Если СистемаВзаимодействия.ПолучитьРежимНаблюдения(Обсуждение.Идентификатор) Тогда 
		СистемаВзаимодействия.УстановитьРежимНаблюдения(Обсуждение.Идентификатор, Ложь);
	КонецЕсли;
	
	Сообщение = СистемаВзаимодействия.СоздатьСообщение(Обсуждение.Идентификатор);
	
	Для Каждого Получатель Из Получатели Цикл 
		Сообщение.Получатели.Добавить(Получатель);
	КонецЦикла;
	
	Сообщение.Автор = СистемаВзаимодействия.ИдентификаторТекущегоПользователя();
	Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Предоставлен отчет %1'"), ПолучитьНавигационнуюСсылку(ВариантОтчета));
	
	Попытка
		Сообщение.Записать();
	Исключение
		
		КодОсновногоЯзыка = ОбщегоНазначения.КодОсновногоЯзыка();
		
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Варианты отчетов.Оповещение о предоставлении доступа к варианту отчета'", КодОсновногоЯзыка),
			УровеньЖурналаРегистрации.Ошибка,,
			ПредставлениеВариантаОтчета,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
	КонецПопытки;
	
	#КонецОбласти
	
КонецПроцедуры

Функция ПользователиВариантаОтчета(ВариантОтчета, ВыбранныеПользователи = Неопределено) Экспорт 
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Пользователи.Ссылка КАК Ссылка,
	|	Пользователи.ИдентификаторПользователяИБ КАК Идентификатор
	|ИЗ
	|	РегистрСведений.НастройкиВариантовОтчетов КАК Настройки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Пользователи
	|		ПО (Пользователи.Ссылка = Настройки.Пользователь)
	|ГДЕ
	|	Настройки.Вариант = &ВариантОтчета
	|	И Настройки.Подсистема = ЗНАЧЕНИЕ(Справочник.ИдентификаторыОбъектовМетаданных.ПустаяСсылка)
	|	И Настройки.Видимость
	|	И Пользователи.Ссылка <> &ТекущийПользователь
	|	И (НЕ &ПользователиВыбраны
	|			ИЛИ Пользователи.Ссылка В (&ВыбранныеПользователи))
	|	И НЕ Пользователи.Служебный");
	
	Запрос.УстановитьПараметр("ВариантОтчета", ВариантОтчета);
	Запрос.УстановитьПараметр("ТекущийПользователь", Пользователи.АвторизованныйПользователь());
	Запрос.УстановитьПараметр("ПользователиВыбраны", ВыбранныеПользователи <> Неопределено);
	Запрос.УстановитьПараметр("ВыбранныеПользователи", ВыбранныеПользователи);
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Обработчики обновления.

// Регистрирует данные к обновлению в плане обмена ОбновлениеИнформационнойБазы
//  см. Стандарты и методики разработки прикладных решений: Параллельный режим отложенного обновления.
//
// Параметры:
//  Параметры - см. ОбновлениеИнформационнойБазы.ОсновныеПараметрыОтметкиКОбработке
//
Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт 
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Отчеты.Ссылка КАК Вариант,
	|	ЗНАЧЕНИЕ(Справочник.ИдентификаторыОбъектовМетаданных.ПустаяСсылка) КАК Подсистема,
	|	НЕОПРЕДЕЛЕНО КАК Пользователь,
	|	ВЫБОР
	|		КОГДА Отчеты.ВидимостьПоУмолчаниюПереопределена
	|			ИЛИ ЕСТЬNULL(ОтчетыКонфигурации.ВидимостьПоУмолчанию, ОтчетыРасширений.ВидимостьПоУмолчанию) ЕСТЬ NULL
	|		ТОГДА Отчеты.ВидимостьПоУмолчанию
	|		ИНАЧЕ ЕСТЬNULL(ОтчетыКонфигурации.ВидимостьПоУмолчанию, ОтчетыРасширений.ВидимостьПоУмолчанию)
	|	КОНЕЦ КАК Видимость,
	|	ЛОЖЬ КАК БыстрыйДоступ
	|ПОМЕСТИТЬ Настройки
	|ИЗ
	|	Справочник.ВариантыОтчетов КАК Отчеты
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыОтчетов.Размещение КАК РазмещениеОтчетов
	|		ПО РазмещениеОтчетов.Ссылка = Отчеты.Ссылка
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПредопределенныеВариантыОтчетов КАК ОтчетыКонфигурации
	|		ПО ОтчетыКонфигурации.Ссылка = Отчеты.ПредопределенныйВариант
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПредопределенныеВариантыОтчетов.Размещение КАК РазмещениеОтчетовКонфигурации
	|		ПО РазмещениеОтчетовКонфигурации.Ссылка = Отчеты.ПредопределенныйВариант
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПредопределенныеВариантыОтчетовРасширений КАК ОтчетыРасширений
	|		ПО ОтчетыРасширений.Ссылка = Отчеты.ПредопределенныйВариант
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПредопределенныеВариантыОтчетовРасширений.Размещение КАК РазмещениеОтчетовРасширений
	|		ПО РазмещениеОтчетовРасширений.Ссылка = Отчеты.ПредопределенныйВариант
	|ГДЕ
	|	ЕСТЬNULL(РазмещениеОтчетов.Использование, ИСТИНА) 
	|	И НЕ ЕСТЬNULL(РазмещениеОтчетов.Подсистема,
	|		ЕСТЬNULL(РазмещениеОтчетовКонфигурации.Подсистема, РазмещениеОтчетовРасширений.Подсистема)) ЕСТЬ NULL
	|;
	|
	|ВЫБРАТЬ
	|	Настройки.Вариант,
	|	Настройки.Подсистема,
	|	Настройки.Пользователь,
	|	Настройки.Видимость,
	|	Настройки.БыстрыйДоступ
	|ИЗ
	|	Настройки КАК Настройки
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиВариантовОтчетов КАК НастройкиСуществующие
	|		ПО НастройкиСуществующие.Вариант = Настройки.Вариант
	|		И НастройкиСуществующие.Подсистема = Настройки.Подсистема
	|ГДЕ
	|	Настройки.Видимость
	|	И НастройкиСуществующие.Вариант ЕСТЬ NULL");
	
	Ссылки = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Вариант");
	
	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, Ссылки);
	
КонецПроцедуры

// Обрабатывает данные, зарегистрированные в плане обмена ОбновлениеИнформационнойБазы
//  см. Стандарты и методики разработки прикладных решений: Параллельный режим отложенного обновления.
//
// Параметры:
//  Параметры - см. ОбновлениеИнформационнойБазы.ОсновныеПараметрыОтметкиКОбработке
//
Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт 
	
	Вариант = ОбновлениеИнформационнойБазы.ВыбратьСсылкиДляОбработки(Параметры.Очередь, "Справочник.ВариантыОтчетов");
	
	Данные = Новый Структура("Вариант, Пользователь, Подсистема, Видимость, БыстрыйДоступ");
	Данные.Подсистема = Справочники.ИдентификаторыОбъектовМетаданных.ПустаяСсылка();
	Данные.Видимость = Истина;
	Данные.БыстрыйДоступ = Ложь;
	
	МетаданныеРегистра = Метаданные.РегистрыСведений.НастройкиВариантовОтчетов;
	ПредставлениеРегистра = МетаданныеРегистра.Представление();
	
	Обработано = 0;
	Отказано = 0;
	
	#Область ОбработкаДанных
	
	Пока Вариант.Следующий() Цикл
		
		Данные.Вариант = Вариант.Ссылка;
		
		Попытка
			
			ПеренестиНастройкиДоступностиВариантаОтчета(Данные);
			Обработано = Обработано + 1;
			
		Исключение
			
			Отказано = Отказано + 1;
			
			ШаблонКомментария = НСтр("ru = 'Не удалось перенести настройки доступности варианта отчета ""%1"" в регистр ""%2""
				|по причине: %3'");
				
			Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				ШаблонКомментария,
				Вариант.Ссылка,
				ПредставлениеРегистра,
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				
			ЗаписьЖурналаРегистрации(
				ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
				УровеньЖурналаРегистрации.Предупреждение,
				МетаданныеРегистра,,
				Комментарий);
			
		КонецПопытки;
		
	КонецЦикла;
	
	#КонецОбласти
	
	#Область ОбработкаСтатистики
	
	Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(
		Параметры.Очередь, Метаданные.Справочники.ВариантыОтчетов.ПолноеИмя());
	
	Если Обработано = 0 И Отказано <> 0 Тогда
		
		ШаблонСообщения = НСтр("ru = 'Процедуре ПеренестиНастройкиДоступностиВариантаОтчета не удалось обработать некоторые данные: %1'");
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения, Отказано);
		
		ВызватьИсключение ТекстСообщения;
		
	Иначе
		
		ШаблонКомментария = НСтр("ru = 'Процедура ПеренестиНастройкиДоступностиВариантаОтчета обработала очередной пакет данных: %1'");
		Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонКомментария, Обработано);
		
		ЗаписьЖурналаРегистрации(
			ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Информация,
			МетаданныеРегистра,,
			Комментарий);
		
	КонецЕсли;
	
	#КонецОбласти
	
КонецПроцедуры

Процедура ПеренестиНастройкиДоступностиВариантаОтчета(Данные)
	
	НачатьТранзакцию();
	
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		
		ЭлементБлокировки = Блокировка.Добавить("Справочник.ВариантыОтчетов");
		ЭлементБлокировки.УстановитьЗначение("Ссылка", Данные.Вариант);
		
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.НастройкиВариантовОтчетов");
		ЭлементБлокировки.УстановитьЗначение("Вариант", Данные.Вариант);
		
		Блокировка.Заблокировать();
		
		Записи = СоздатьНаборЗаписей();
		Записи.Отбор.Вариант.Установить(Данные.Вариант);
		Записи.Отбор.Пользователь.Установить(Данные.Пользователь);
		Записи.Отбор.Подсистема.Установить(Данные.Подсистема);
		
		Запись = Записи.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, Данные);
		
		ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(Записи);
		ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(Данные.Вариант);
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		ВызватьИсключение;
		
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
